# 11- Copy data from clip board

In [2]:
# download dataset
import seaborn as sns
import pandas as pd

df = sns.load_dataset('titanic')
df.to_excel('save_2.xlsx')

## Only for advance people press win + v and activate clipboard
## Now you can copy any thing any times it can be pasted by pressing win + v

In [4]:
# 1.1 read clipboard in python
df= pd.read_clipboard()
df
# 1.2 save readed dataset
df.to_csv('your copied data.csv')

# 12- split dataframe into two subsets

In [5]:
# download dataset
import seaborn as sns
import pandas as pd

df = sns.load_dataset('titanic')
df.to_excel('save_2.xlsx')

In [7]:
df.shape # its print rows * columns in tuple foramt

(891, 15)

In [8]:
len(df) # its only print rows length in numaric foramt

891

In [9]:
# fetch random dataset
kashti_1 = df.sample(frac=0.50, random_state=1)
kashti_1.shape

(446, 15)

In [10]:
# remove same rows that present in kashti_1 dataset
kashti_2 = df.drop(kashti_1.index)
kashti_2.shape

(445, 15)

In [11]:
kashti_1.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
862,1,1,female,48.0,0,0,25.9292,S,First,woman,False,D,Southampton,yes,True
223,0,3,male,NaN,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
84,1,2,female,17.0,0,0,10.5000,S,Second,woman,False,NaN,Southampton,yes,True
680,0,3,female,NaN,0,0,8.1375,Q,Third,woman,False,NaN,Queenstown,no,True
535,1,2,female,7.0,0,2,26.2500,S,Second,child,False,NaN,Southampton,yes,False

In [12]:
kashti_2.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
10,1,3,female,4.0,1,1,16.7000,S,Third,child,False,G,Southampton,yes,False
15,1,2,female,55.0,0,0,16.0000,S,Second,woman,False,NaN,Southampton,yes,True
18,0,3,female,31.0,1,0,18.0000,S,Third,woman,False,NaN,Southampton,no,False

In [13]:
df.shape

(891, 15)

In [14]:
len(kashti_1) + len(kashti_2)

891

# 13- Join two datasets

In [15]:
# 1 append method its (being deprecated use concat)
df1 = kashti_1.append(kashti_2)
df1.shape

(891, 15)

## Pandas concat vs append vs join vs merge

##### Concat gives the flexibility to join based on the axis( all rows or all columns)

##### Append is the specific case(axis=0, join='outer') of concat (being deprecated use concat)

##### Join is based on the indexes (set by set_index) on how variable =['left','right','inner','couter']

##### Merge is based on any particular column each of the two dataframes, this columns are variables on like 'left_on', 'right_on', 'on'

In [17]:
# 2 concat method
df1 = pd.concat([kashti_1, kashti_2])
df1.shape

(891, 15)

# 14- Filtering a dataset

In [18]:
df.sex.unique()

array(['male', 'female'], dtype=object)

In [19]:
df[(df.sex=="male")]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
883,0,2,male,28.0,0,0,10.5000,S,Second,man,True,NaN,Southampton,no,True
884,0,3,male,25.0,0,0,7.0500,S,Third,man,True,NaN,Southampton,no,True
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [20]:
df['class'].unique()

['Third', 'First', 'Second']
Categories (3, object): ['First', 'Second', 'Third']

In [21]:
print(df.embark_town.unique())
df[(df.embark_town=='Southampton')].shape

['Southampton' 'Cherbourg' 'Queenstown' nan]

(644, 15)

In [23]:
df[((df.embark_town=='Southampton')|
    (df.embark_town=='Queenstown')) & 
    (df.sex=="male")]

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
881,0,3,male,33.0,0,0,7.8958,S,Third,man,True,NaN,Southampton,no,True
883,0,2,male,28.0,0,0,10.5000,S,Second,man,True,NaN,Southampton,no,True
884,0,3,male,25.0,0,0,7.0500,S,Third,man,True,NaN,Southampton,no,True
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [24]:
df[df.embark_town.isin(['Queenstown', 'Southampton'])].head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True

In [28]:
df[df.age > 30].shape # less than < greater than >

(305, 15)

# 15- Filtering by large categories

In [35]:
df['sex'].value_counts()
# output format
# unique    count

male      577
female    314
Name: sex, dtype: int64

In [36]:
df['age'].value_counts().nlargest(3) # its used when you want only 3 largest no

24.0    30
22.0    27
18.0    26
Name: age, dtype: int64

In [39]:
counts = df.embark_town.value_counts()
counts.nlargest(3).index

Index(['Southampton', 'Cherbourg', 'Queenstown'], dtype='object')

In [42]:
counts = df.age.value_counts()
counts.index

Float64Index([24.0, 22.0, 18.0, 19.0, 28.0, 30.0, 21.0, 25.0, 36.0, 29.0, 32.0,
              35.0, 27.0, 26.0, 16.0, 31.0, 20.0, 34.0, 33.0, 23.0, 39.0, 40.0,
              17.0, 42.0, 45.0, 38.0, 50.0,  2.0,  4.0, 44.0, 48.0, 47.0, 54.0,
               9.0,  1.0, 51.0, 14.0, 52.0, 37.0, 49.0, 41.0,  3.0, 58.0, 15.0,
              43.0, 62.0, 56.0,  5.0, 11.0, 60.0,  8.0,  6.0, 46.0, 61.0, 65.0,
               7.0, 10.0, 64.0, 13.0, 63.0, 30.5, 57.0, 70.0, 0.75, 71.0, 59.0,
              0.83, 40.5, 55.0, 32.5, 28.5, 45.5, 34.5, 0.42, 0.67, 66.0, 24.5,
              80.0, 20.5, 53.0, 14.5, 70.5, 12.0, 36.5, 55.5, 0.92, 23.5,
              74.0],
             dtype='float64')

In [43]:
counts = df.who.value_counts()
counts.nlargest(3)

man      537
woman    271
child     83
Name: who, dtype: int64

In [46]:
df[df.who.isin(counts.nlargest(2).index)].head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True